In [2]:
import pandas as pd
import numpy as np

In [2]:
cities = ["Adana","Yalova","Isparta","Bursa","Rize"]

In [3]:
dataframe1 = pd.DataFrame(cities)
dataframe1

         0
0    Adana
1   Yalova
2  Isparta
3    Bursa
4     Rize

In [5]:
dataframe1[1] = ["01","77","32","16","53"]
dataframe1

         0   1
0    Adana  01
1   Yalova  77
2  Isparta  32
3    Bursa  16
4     Rize  53

In [6]:
dataframe1.columns = ["Sehir adi","Plaka"]
dataframe1

  Sehir adi Plaka
0     Adana    01
1    Yalova    77
2   Isparta    32
3     Bursa    16
4      Rize    53

In [7]:
veri1 = {
    "Sehir" : ["Adana","Yalova","Isparta","Bursa","Rize"],
    "Plaka" : ["01","77","32","16","53"]
}
dataframe2 = pd.DataFrame(veri1)
dataframe2

     Sehir Plaka
0    Adana    01
1   Yalova    77
2  Isparta    32
3    Bursa    16
4     Rize    53

In [8]:
#Tarih İşlemleri
gunler1 = pd.date_range(start= '2025-09-06', end= '2025-09-22')
gunler1

DatetimeIndex(['2025-09-06', '2025-09-07', '2025-09-08', '2025-09-09',
               '2025-09-10', '2025-09-11', '2025-09-12', '2025-09-13',
               '2025-09-14', '2025-09-15', '2025-09-16', '2025-09-17',
               '2025-09-18', '2025-09-19', '2025-09-20', '2025-09-21',
               '2025-09-22'],
              dtype='datetime64[ns]', freq='D')

In [13]:
gunler1 = pd.date_range(start= '2025-09-06', periods = 17)
gunler1

DatetimeIndex(['2025-09-06', '2025-09-07', '2025-09-08', '2025-09-09',
               '2025-09-10', '2025-09-11', '2025-09-12', '2025-09-13',
               '2025-09-14', '2025-09-15', '2025-09-16', '2025-09-17',
               '2025-09-18', '2025-09-19', '2025-09-20', '2025-09-21',
               '2025-09-22'],
              dtype='datetime64[ns]', freq='D')

In [16]:
gunler3 = pd.date_range('today', periods = 5)
gunler3

DatetimeIndex(['2025-09-22 13:11:30.401286', '2025-09-23 13:11:30.401286',
               '2025-09-24 13:11:30.401286', '2025-09-25 13:11:30.401286',
               '2025-09-26 13:11:30.401286'],
              dtype='datetime64[ns]', freq='D')

In [3]:
Matris1 = np.random.randint(200,800,25).reshape(5,5)
Matris1

array([[455, 214, 753, 733, 566],
       [255, 401, 286, 672, 728],
       [655, 302, 293, 797, 518],
       [385, 717, 623, 788, 755],
       [225, 751, 303, 529, 272]], dtype=int32)

In [ ]:
dataframe3 = pd.DataFrame(M